tap "homebrew/bundle"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Manage multiple Node.js versions
brew "nvm"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Chromium based browser
cask "arc"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# Web browser
cask "google-chrome"
# Convert your caps lock key or any of your modifier keys to the hyper key
cask "hyperkey"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "GitHub.copilot"
vscode "ritwickdey.LiveServer"
vscode "withfig.fig"
